{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
{-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}

-- Въпроси?

-- За домашно от миналия път:
-- Задача 3: Да се напише функция, която приема списък и число n, и връща нов списък от n-те най-големи числа в списъка. 
--  Ако списъкът има по-малко от n елемента да връща грешка
-- Задача 8: Да се напише обратната функция (superWeakDecode) 

-- Задача 1: Да се дефинира типа Maybe
-- Задача 1.1: Да се напише функцията safeHead
-- Задача 1.2: Да се напише функцията mapMaybe 

-- Задача 2: Генерирайте всички цели числа
-- Задача 2.1: Генерирайте всички цели четни числа
-- Задача 2.2: Генерирайте всички цели четни числа по-големи от подадено n

-- Задача 3: Дефинирайте тип Potion. Той трябва да има: име и тип (Healing, Poison, Effect)
-- За тази задача точки живот ще наричаме стойност от тип Int
-- Типовете се различават по следния начин: 
    -- Healing - увеличава точките живот с число
    -- Poison - намаля точките живот с число
    -- Effect - прилага функция върху точките живот

-- Задача 4: Да се напише функция, която приема Potion и точки живот и изпълнява действието на Potion-а върху точките живот.
    -- Ако точките живот ще паднат под 0 да върне Nothing
-- Задача 5: Да се напише функция, която комбинира 2 Potions. (т.е създава нов Potion, който прилага ефектите им последователно)
-- Задача 6: Да се напише функция, която приема списък от Potion и ги комбинира
-- Задача 7: Да се напише функция, която приема списък от Potion и списък от точки живот.
    -- Прилага всички ефекти върху всички точки живот и връща само тези, които са по-големи от 0
-- Задача 8: Да се напише функция, която приема списък от Potion и списък от точки живот, прилага функцията от задача 7 и връща 2рото най-голямо число.
-- Задача 9: Да се напише функция, която приема списък от Potion и връща списък от наредени двойки от всички възможни комбинации на 2 от тях

-- Задача 10: Да се дефинира тип за матрица от Potion (за следващите задачи наричаме типа просто матрица)
-- Задача 11: Да се напише функция, която приема матрица и връща елементите по главния диагонал
-- Задача 12: Да се напише функция, която приема две матрици и комбинира елементите на еднакви позиции
-- Задача 13: Да се напише функция, която приема матрица и връща един комбиниран Potion
-- Задача 14: Да се напише функция, която приема матрица и я транспонира




