{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
{-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}

-- Какво е монад?
-- Functor - fmap 
-- Applicative - (<*>)
-- Monad - (>>=)

-- Какви монади познаваме? 
    -- []
    -- Maybe
    -- Either 

-- IO

-- Да се напише функция, която принтира "Hello world!" в терминала
-- Да се напише функция, която чете стринг от терминала, слага му "!!!" в края и го принтира
-- Да се напише фунцкия, която чете число от терминала, добавя му 1 и го принтира

-- Да се дефинира тип за приют за животни. Той може да бъде или работещ и да пази броя на животните, които приютява, или да е затворен
-- Да се имплементират fmap, <*> и >>= за приюта за животни

-- Да се напише функция, която чете от терминала число. Ако то е 0 - връща затворен приют, в противен случай запазва числото като брой на животните

-- В един град има множество приюти. Всяко животно започва от първия и слиза по дървото, докато намери приют със свободно място (всеки приют има максимално 10 места)
-- Създайте тип, който да представлява дърво от приюти за животни. 
-- Да се напише функция, която добавя нов приют към дървото
-- Да се напише функция, която чете приют от терминала и го добавя към подадено дърво
-- Да се напише функция, която връща първите n приюта от подадено дърво.