{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
{-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}

--- Още малко рекурсия

-- Задача 1: Да се напише функция, която при подадени 2 числа n и m връща n на m-та степен
-- Задача 2: Да се напише функция, която намира сумата на цифрите на подадено число

-- Списъци

-- Задача 1: Да се дефинира списък с числата от 1 до 5
-- Задача 2: Да се напише функция, която генерира списък от числа от 1 до n (n е аргумент на функцията)
-- Задача 3: Да се напише функция, която по подаден списък от числа намира сумата на елементите му
-- Задача 4: Да се напише функция, която по подаден списък и число n връща елемента на n-та позиция в списъка
-- Задача 5: Да се напише функция, която по подаден списък проверява дали всички числа в него са положителни
-- Задача 6: Да се напише функция, която съединява два списъка 
-- Задача 7: Да се напише функция, която съединява два списъка като на четните позиции слага елементите от първия списък,
    -- а на нечетните - от втория
