{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
{-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}

-- map, filter, foldl, foldr

-- Игра с карти:
-- Задача 1: Да се дефинира тип за карта за игра. Всяка карта има цвят и сила
-- Задача 2: Да се дефинира тип за играч. Всеки играч има име и списък от карти.
-- Задача 3: Да се напише функция, която приема играч и връща сумата от силата на картите му
-- Задача 4: Да се напише функция, която приема списък от играчи и връща списък от сумите на картите на всеки
-- Задача 5: Да се напише функция, която приема число и списък от играчи и връща списък само от тези, 
    -- чиято сума на картите е по-висока от подаденото число

-- Wordle:
-- Задача 1: Да се дефинира тип word
-- Задача 2: Да се напише функция, която приема дума и буква и проверява дали буквата се съдържа в думата
-- Задача 3: Да се напише функция, която приема списък от думи и буква и връща само тези думи, в които се съдържа буквата
-- Задача 4: Да се напише функция, която приема списък от думи и буква и връща само тези думи, в които НЕ се съдържа буквата
-- Задача 5: Да се напише функция, която приема списък от думи и два списъка с букви. 
-- Функцията трябва да връща списък от думите, в които се съдържат всички букви от първия списък, но не се съдържат буквите от втория.
