{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
{-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}

-- Дефиниране на типове
-- data
-- type
-- newtype

-- Задача 1: Да се дефинира тип Point, който представлява наредена двойка от целочислени координати x и y
-- Задача 2: Да се напише функция, която приема две точки и връща точката, която се намира посредата 
-- Задача 3: Да сe напише функция, която приема списък от точки и връща точката с най-голям х

-- Задача 4: Да се дефинира тип Animal, което има стойности Cow, Cat и Dog
-- Задача 5: Да се напише функция, която приема животно и връща String, който е звука, който издава животното

-- Задача 6: Да се дефинира тип Shape, който има стойности Circle и Rectangle
    -- Кръгът има радиус, а правоъгълникът - дължина на страните
-- Задача 7: Да се напише функция, която приема фигура и връща нейното лице
-- Задача 8: Да се напише функция, която приема две фигури и връща нова фигура, чиито размери са сумата на двете фигури
    -- Пример: Circle 5, Circle 6 -> Circle 11

-- Задача 9: Да се напише функция, която приема фигура и връща нова фигура по следното правило:
    -- Circle x -> Rectangle x/2 x/2
    -- Rectangle x y -> Circle x+y

-- Задача 10: Да се напише функция, която приема списък от фигури и връща списъка като върху всеки елемент прилага функцията от задача 9

-- Какво са функции от по-висок ред? 

-- Задача 11: Да се напише функцията map
-- Задача 12: Да се направи 10-та задача, използвайки map
-- Задача 13: Да се напише функция, която приема списък от фигури и увеличава всички дължини с 1
 
-- Задача 14: Да се напише функция, която приема списък от числа и число n и връща увеличава всеки елемент на списъка с n