{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
{-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}
import Data.Char (ord, chr)
{-# HLINT ignore "Avoid lambda" #-}
{-# HLINT ignore "Eta reduce" #-}

-- Организационни въпроси:
-- Няма да имаме упражнение на 28.03 
-- Искате ли допълнително преди контролното?

-- Въпроси?

-- Задача 1: Да се напише функция, която приема списък и връща неговия най-дълъг растящ подсписък
-- Задача 2: Да се напише функция, която приема списък и число n и връща нов списък от n-те най-големи числа в списъка. 
    -- Ако списъкът има по-малко от n елемента да връща грешка
-- Задача 3: Да се напише mergesort

-- ord, chr
-- Задача 4: Да се напише функция, която приема String и връща списък от наредени двойки като групира последователни символи в двойката (символ, брой срещания)
-- Задача 5: Да се напише функция, която приема символ и число и връща нов символ по следните правила:
-- (символ, 1) -> същия символ с главна буква
-- (символ, n) -> същия символ с отместване n в ASCII таблицата

-- Задача 6: Да се напише функция, която приема стринг и символ x и връща същия стринг като между всеки два символа е поставен x
-- Задача 7: Да се напише функция superWeakEncode, която приема стринг и връща нов стринг по следните правила:
    -- Замества всяка поредица от еднакви символи със символа, получен от задача 5.
    -- Между всеки едва символа поставя и броя числото, получено от задача 4 (освен когато броят е 1)
    -- Пример: aabbbdcccc -> c2e3Dg4




